[Killed] BlockStatement
main/pages/Drivers/DriverRequestCreatePage.js:3:51
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function DriverRequestCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverRequestCreatePage() {}
 
killedBy: PlaceholderCreatePage tests Renders expected content
statusReason: Error: DriverRequestCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
