[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:70:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Driver" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                    <NavDropdown.Item as={Link} to="/drivers">Driver</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:70:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Driver" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                    <NavDropdown.Item as={Link} to="/drivers">Driver</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_DRIVER") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="nav-item dropdown" data-testid="appnavbar-admin-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-admin-dropdown" role="button" tabindex="0">Admin</a></div> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:100:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (
-                <>
-                  <NavDropdown.Item as={Link} to="/drivers">Driver</NavDropdown.Item>
-                </>
-              )
+              true
             }
             <Nav className="ml-auto">

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:100:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (
+              true && (
                 <>
                   <NavDropdown.Item as={Link} to="/drivers">Driver</NavDropdown.Item>
