[Killed] BlockStatement
main/pages/Drivers/DriverRequestEditPage.js:3:49
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function DriverRequestEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>   
-  )
-}
+export default function DriverRequestEditPage() {}
 
killedBy: PlaceholderEditPage tests Renders expected content
statusReason: Error: DriverRequestEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
