[Killed] BlockStatement
main/components/Nav/AppNavbar.js:7:37
 import headerImg from "../../../assets/stork.png"
 import AppNavbarLocalhost from "main/components/Nav/AppNavbarLocalhost"
 
-function isParticipant(currentUser) {
-  return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-    || hasRole(currentUser, "ROLE_RIDER")
-    || hasRole(currentUser, "ROLE_MEMBER")
-  );
-}
+function isParticipant(currentUser) {}
 
 function createRideRequest(currentUser) {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:9:5
 
 function isParticipant(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-    || hasRole(currentUser, "ROLE_RIDER")
-    || hasRole(currentUser, "ROLE_MEMBER")
+    false
   );
 }
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:34:10
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
+        (currentUrl.startsWith("http://localhost:3000") && currentUrl.startsWith("http://127.0.0.1:3000")) && (
           <AppNavbarLocalhost url={currentUrl} />
         )
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:93:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_MEMBER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:98:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <Nav.Link as={Link} to="/admin/applications/riders">Rider Applications</Nav.Link>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <Nav.Link as={Link} to="/admin/applications/riders">Rider Applications</Nav.Link>
               }
             </Nav>
killedBy: AppNavbar tests renders RiderApplicationAdmin links correctly for admin
statusReason: Error: Unable to find an element with the text: Rider Applications. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
