[Killed] BlockStatement
main/pages/Drivers/DriverRequestIndexPage.js:3:50
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function DriverRequestIndexPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/drivers/create">Create</a></p>
-        <p><a href="/drivers/edit/1">Edit</a></p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverRequestIndexPage() {}
 
killedBy: PlaceholderIndexPage tests Renders expected content
statusReason: Error: DriverRequestIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
