[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:85:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-table" as={Link} to="/shift/list">Driver Shifts</NavDropdown.Item>
-                    { createShift(currentUser) }
-                    </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-table" as={Link} to="/shift/list">Driver Shifts</NavDropdown.Item>
+                    {createShift(currentUser)}
+                    </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:85:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-table" as={Link} to="/shift/list">Driver Shifts</NavDropdown.Item>
-                    { createShift(currentUser) }
-                    </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
