[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:10:48
 const ProfilePage = () => {
 
     const { data: currentUser } = useCurrentUser();
-    const [showModal, setShowModal] = useState(false);
+    const [showModal, setShowModal] = useState(true);
     const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
 

[Killed] OptionalChaining
src/main/pages/ProfilePage.js:11:40
 
     const { data: currentUser } = useCurrentUser();
     const [showModal, setShowModal] = useState(false);
-    const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
+    const [phone, setPhone] = useState(currentUser?.root.user?.phone || '');
 
     const handleShow = () => setShowModal(true);
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Survived] OptionalChaining
src/main/pages/ProfilePage.js:11:40
 
     const { data: currentUser } = useCurrentUser();
     const [showModal, setShowModal] = useState(false);
-    const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
+    const [phone, setPhone] = useState(currentUser.root?.user?.phone || '');
 
     const handleShow = () => setShowModal(true);

[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:13:43
     const [showModal, setShowModal] = useState(false);
     const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
 
-    const handleShow = () => setShowModal(true);
+    const handleShow = () => setShowModal(false);
     const handleClose = () => setShowModal(false);
     const handleSave = async () => {

[Survived] ArrowFunction
src/main/pages/ProfilePage.js:13:24
     const [showModal, setShowModal] = useState(false);
     const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
 
-    const handleShow = () => setShowModal(true);
+    const handleShow = () => undefined;
     const handleClose = () => setShowModal(false);
     const handleSave = async () => {

[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:14:44
     const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
 
     const handleShow = () => setShowModal(true);
-    const handleClose = () => setShowModal(false);
+    const handleClose = () => setShowModal(true);
     const handleSave = async () => {
         const response = await fetch('/api/userprofile/updatecellphone', {

[Survived] ArrowFunction
src/main/pages/ProfilePage.js:14:25
     const [phone, setPhone] = useState(currentUser?.root?.user?.phone || '');
 
     const handleShow = () => setShowModal(true);
-    const handleClose = () => setShowModal(false);
+    const handleClose = () => undefined;
     const handleSave = async () => {
         const response = await fetch('/api/userprofile/updatecellphone', {

[Survived] BlockStatement
src/main/pages/ProfilePage.js:15:36
 
     const handleShow = () => setShowModal(true);
     const handleClose = () => setShowModal(false);
-    const handleSave = async () => {
-        const response = await fetch('/api/userprofile/updatecellphone', {
-            method: 'PUT',
-            headers: {
-                'Content-Type': 'application/x-www-form-urlencoded',
-            },
-            body: new URLSearchParams({
-                cellphone: phone
-            })
-        });
-    
-        if (response.ok) {
-            const result = await response.json();
-            console.log(result);
-            setShowModal(false);
-        } else {
-            console.error('Failed to update cellphone number');
-        }
-    };    
+    const handleSave = async () => {};    
 
     if (!currentUser.loggedIn) {

[Survived] StringLiteral
src/main/pages/ProfilePage.js:16:38
     const handleShow = () => setShowModal(true);
     const handleClose = () => setShowModal(false);
     const handleSave = async () => {
-        const response = await fetch('/api/userprofile/updatecellphone', {
+        const response = await fetch("", {
             method: 'PUT',
             headers: {

[Survived] StringLiteral
src/main/pages/ProfilePage.js:19:33
         const response = await fetch('/api/userprofile/updatecellphone', {
             method: 'PUT',
             headers: {
-                'Content-Type': 'application/x-www-form-urlencoded',
+                'Content-Type': "",
             },
             body: new URLSearchParams({

[Survived] BlockStatement
src/main/pages/ProfilePage.js:26:26
             })
         });
     
-        if (response.ok) {
-            const result = await response.json();
-            console.log(result);
-            setShowModal(false);
-        } else {
+        if (response.ok) {} else {
             console.error('Failed to update cellphone number');
         }

[Survived] BooleanLiteral
src/main/pages/ProfilePage.js:29:26
         if (response.ok) {
             const result = await response.json();
             console.log(result);
-            setShowModal(false);
+            setShowModal(true);
         } else {
             console.error('Failed to update cellphone number');

[Survived] BlockStatement
src/main/pages/ProfilePage.js:30:16
             const result = await response.json();
             console.log(result);
             setShowModal(false);
-        } else {
-            console.error('Failed to update cellphone number');
-        }
+        } else {}
     };    
 

[Killed] StringLiteral
src/main/pages/ProfilePage.js:60:38
                     <RoleBadge role={"ROLE_USER"} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser}/>
-                    <RoleBadge role={"ROLE_DRIVER"} currentUser={currentUser}/>
+                    <RoleBadge role={""} currentUser={currentUser}/>
                     <RoleBadge role={"ROLE_RIDER"} currentUser={currentUser}/>
                 </Col>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-missing-driver"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ArrowFunction
src/main/pages/ProfilePage.js:75:39
                         <Form.Control 
                             type="text" 
                             value={phone} 
-                            onChange={(e) => setPhone(e.target.value)} 
+                            onChange={() => undefined} 
                             placeholder="Enter new phone number"
                         />
