[Killed] BlockStatement
main/components/Nav/AppNavbar.js:23:35
   }
 }
 
-function createShift(currentUser) {
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    return (<NavDropdown.Item data-testid="appnavbar-shift-dropdown-create" as={Link} to="/shift/create">Create Shift</NavDropdown.Item>)
-  } else {
-    return (<div data-testid="NO-appnavbar-shift-dropdown-create"></div>)
-  }
-}
+function createShift(currentUser) {}
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:24:7
 }
 
 function createShift(currentUser) {
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (false) {
     return (<NavDropdown.Item data-testid="appnavbar-shift-dropdown-create" as={Link} to="/shift/create">Create Shift</NavDropdown.Item>)
   } else {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:24:7
 }
 
 function createShift(currentUser) {
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     return (<NavDropdown.Item data-testid="appnavbar-shift-dropdown-create" as={Link} to="/shift/create">Create Shift</NavDropdown.Item>)
   } else {
killedBy: AppNavbar tests renders shift table links correctly for driver
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="dropdown-item" data-rr-ui-dropdown-item="" data-testid="appnavbar-shift-dropdown-create" href="/shift/create">Create Shift</a> instead

[Killed] BlockStatement
main/components/Nav/AppNavbar.js:26:10
 function createShift(currentUser) {
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     return (<NavDropdown.Item data-testid="appnavbar-shift-dropdown-create" as={Link} to="/shift/create">Create Shift</NavDropdown.Item>)
-  } else {
-    return (<div data-testid="NO-appnavbar-shift-dropdown-create"></div>)
-  }
+  } else {}
 }
 
killedBy: AppNavbar tests renders shift table links correctly for driver
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ObjectLiteral
main/components/Nav/AppNavbar.js:33:13
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
   const styles = {
-    navbar: {
-      backgroundColor: "#003660",
-    }
+    navbar: {}
   }
 
killedBy: AppNavbar tests background of AppNavbar is UCSB's navy color
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(0, 54, 96);

<html>
  <head />

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:85:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-table" as={Link} to="/shift/">Driver Shifts</NavDropdown.Item>
-                    { createShift(currentUser) }
-                    </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:85:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-table" as={Link} to="/shift/">Driver Shifts</NavDropdown.Item>
-                    { createShift(currentUser) }
-                    </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-table" as={Link} to="/shift/">Driver Shifts</NavDropdown.Item>
+                    {createShift(currentUser)}
+                    </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:101:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_MEMBER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:101:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_MEMBER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                hasRole(currentUser, "ROLE_MEMBER") || <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
               }
               {
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:106:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <Nav.Link as={Link} to="/admin/applications/riders">Rider Applications</Nav.Link>
-                )
+                false
               }
 
killedBy: AppNavbar tests renders RiderApplicationAdmin links correctly for admin
statusReason: Error: Unable to find an element with the text: Rider Applications. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:106:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <Nav.Link as={Link} to="/admin/applications/riders">Rider Applications</Nav.Link>
-                )
+                true
               }
 
killedBy: AppNavbar tests renders RiderApplicationAdmin links correctly for admin
statusReason: Error: Unable to find an element with the text: Rider Applications. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
