[Killed] ArrowFunction
main/pages/Shift/ShiftCreatePage.js:9:33
 
 export default function ShiftCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (shift) => ({
-        url: "/api/shift/post",
-        method: "POST",
-        params: {
-            day: shift.day,
-            shiftStart: shift.shiftStart,
-            shiftEnd: shift.shiftEnd,
-            driverID: shift.driverID,
-            driverBackupID: shift.driverBackupID
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (shift) => {
killedBy: ShiftCreatePage tests on submit, makes request to backend and redirects to /shift
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Shift/ShiftCreatePage.js:9:45
 
 export default function ShiftCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (shift) => ({
-        url: "/api/shift/post",
-        method: "POST",
-        params: {
-            day: shift.day,
-            shiftStart: shift.shiftStart,
-            shiftEnd: shift.shiftEnd,
-            driverID: shift.driverID,
-            driverBackupID: shift.driverBackupID
-        }
-    });
+    const objectToAxiosParams = (shift) => ({});
 
     const onSuccess = (shift) => {
killedBy: ShiftCreatePage tests on submit, makes request to backend and redirects to /shift
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Shift/ShiftCreatePage.js:21:34
         }
     });
 
-    const onSuccess = (shift) => {
-        toast(`New Shift Created - id: ${shift.id} driverID: ${shift.driverID}`);
-    }
+    const onSuccess = (shift) => {}
 
     const mutation = useBackendMutation(
killedBy: ShiftCreatePage tests on submit, makes request to backend and redirects to /shift
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Shift Created - id: 4 driverID: 6"

Number of calls: 0
