[Killed] ArrowFunction
main/pages/Shift/ShiftEditPage.js:23:36
         }
     );
     
-    const objectToAxiosPutParams = (shift) => ({
-        url: "/api/shift",
-        method: "PUT",
-        params: {
-            id: shift.id
-        },
-        data: {
-            day: shift.day,
-            shiftStart: shift.shiftStart,
-            shiftEnd: shift.shiftEnd,
-            driverID: shift.driverID,
-            driverBackupID: shift.driverBackupID
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (shift) => {
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Shift/ShiftEditPage.js:24:14
     );
     
     const objectToAxiosPutParams = (shift) => ({
-        url: "/api/shift",
+        url: "",
         method: "PUT",
         params: {
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Shift/ShiftEditPage.js:29:15
         params: {
             id: shift.id
         },
-        data: {
-            day: shift.day,
-            shiftStart: shift.shiftStart,
-            shiftEnd: shift.shiftEnd,
-            driverID: shift.driverID,
-            driverBackupID: shift.driverBackupID
-        }
+        data: {}
     });
 
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"day\":\"Thursday\",\"shiftStart\":\"11:45AM\",\"shiftEnd\":\"4:15PM\",\"driverID\":\"10\",\"driverBackupID\":\"13\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Shift/ShiftEditPage.js:38:34
         }
     });
 
-    const onSuccess = (shift) => {
-        toast(`Shift Updated - id: ${shift.id}`);
-    }
+    const onSuccess = (shift) => {}
 
     const mutation = useBackendMutation(
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Shift/ShiftEditPage.js:39:15
     });
 
     const onSuccess = (shift) => {
-        toast(`Shift Updated - id: ${shift.id}`);
+        toast(``);
     }
 
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Shift Updated - id: 5"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/Shift/ShiftEditPage.js:55:20
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
-        return <Navigate to="/shift" />
-    }
+    if (isSuccess) {}
 
     return (
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/shift"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Shift/ShiftEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit Shift</h1>
                 {
-                    shift && <ShiftForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={shift} />
+                    false
                 }
             </div>
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ShiftForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Shift/ShiftEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit Shift</h1>
                 {
-                    shift && <ShiftForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={shift} />
+                    shift || <ShiftForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={shift} />
                 }
             </div>
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, day, shiftStart, shiftEnd, driverID, driverBackupID}). If you meant to render a collection of children, use an array instead.
