[Killed] ArrowFunction
main/pages/RiderApplication/RiderApplicationCreatePage.js:9:31
 
 export default function RideRequestCreatePage() {
 
-  const objectToAxiosParams = (riderApplication) => ({
-      url: "/api/riderApplication/new",
-      method: "POST",
-      params: {
-          perm_number: riderApplication.perm_number,
-          description: riderApplication.description,
-      }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (riderApplication) => {
killedBy: RiderApplicationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationCreatePage.js:9:54
 
 export default function RideRequestCreatePage() {
 
-  const objectToAxiosParams = (riderApplication) => ({
-      url: "/api/riderApplication/new",
-      method: "POST",
-      params: {
-          perm_number: riderApplication.perm_number,
-          description: riderApplication.description,
-      }
-  });
+  const objectToAxiosParams = (riderApplication) => ({});
 
   const onSuccess = (riderApplication) => {
killedBy: RiderApplicationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/RiderApplication/RiderApplicationCreatePage.js:10:12
 export default function RideRequestCreatePage() {
 
   const objectToAxiosParams = (riderApplication) => ({
-      url: "/api/riderApplication/new",
+      url: "",
       method: "POST",
       params: {
killedBy: RiderApplicationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Rider Application Made - id: 17"

Number of calls: 0

[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationCreatePage.js:18:43
       }
   });
 
-  const onSuccess = (riderApplication) => {
-      toast(`New Rider Application Made - id: ${riderApplication.id}`);
-  }
+  const onSuccess = (riderApplication) => {}
 
   const mutation = useBackendMutation(
killedBy: RiderApplicationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Rider Application Made - id: 17"

Number of calls: 0
