[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationEditPageMember.js:63:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" />
+                {false
                 }
             </div>
killedBy: RiderApplicationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationEditPageMember.js:63:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" />
+                {true
                 }
             </div>
killedBy: RiderApplicationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
