[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationReviewPage.js:3:54
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RiderApplicationReviewPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Review page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RiderApplicationReviewPage() {}
killedBy: RiderApplicationReviewPage tests Renders expected content
statusReason: Error: RiderApplicationReviewPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
