[Killed] BlockStatement
src/main/pages/PrivacyPolicy.js:3:41
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function PrivacyPolicy() {
-    return (
-        <BasicLayout>
-            <div className="PrivacyPolicy">
-                <h2>Privacy Policy</h2>
-                <a href="privacy.html">To privacy policy page</a>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function PrivacyPolicy() {}
killedBy: Privacy Policy tests contains proper text
statusReason: Error: PrivacyPolicy(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
